/*
Завдання 4. У театрі є прямокутна сцена розміром n*m. 
Для розміщення акторів на сцені директор театру надав вам план, де вказано, де мають стояти актори, а де ні.
На сцені встановлений прожектор, який може освітлювати в одному з чотирьох напрямків: ліворуч, вгору, 
вправо або донизу, якщо дивитися на сцену зверху. Таким чином, позиція прожектора визначається клітиною, 
в якій він встановлений, та напрямком, в якому він світить.

Вам необхідно обрати “хорошу позицію” для встановлення прожектора на сцені, за якої будуть виконуватися дві умови: 
у вибраній клітці не повинно бути актора, а в напрямку, куди світитиме прожектор, повинен бути хоча б один актор.
Вам потрібно визначити кількість можливих “хороших позицій”, де можна встановити прожектор на сцені. Дві позиції вважаються різними,
якщо вони відрізняються клітиною, де встановлений прожектор, або напрямком, в якому він світить.
*/

// Функція запису у JSON файл:
const writeJson = (data, path) => {
    const fs = require('fs');
    fs.writeFileSync(path, JSON.stringify(data))
};

// Отримуємо план сцени (це двовимірна матриця, у якій кожна клітина позначає кількість акторів у відповідній частині сцени):
const { plan } = require('./json/input.json');

const goodPositionsCount = (plan) => {
    const n = plan.length;
    const m = plan[0].length;
    let count = 0;
    let positionList = []

    const isGood = (row, col) => {
        // Перевірка, чи є на данному місці актори
        if(plan[row][col] > 0){
            return false;
        }

        // Перевірка, чи є зверху актори
        if(row > 0 && plan[row - 1][col] > 0){
            return true;
        }

        // Перевірка, чи є знизу актори
        if(row < n - 1 && plan[row + 1][col] > 0){
            return true;
        }

        // Перевірка, чи є зліва актори
        if(col > 0 && plan[row][col - 1] > 0){
            return true;
        }

        // Перевірка, чи є зправа актори
        if(col < m - 1 && plan[row][col + 1] > 0){
            return true;
        }
    }

    for(let i = 0; i < n; i++){
        for(let j = 0; j < m; j++){
            if(isGood(i, j)){
                count ++;
                positionList.push(`(${i + 1}, ${j + 1})`)
            }
        }
    }

    return {
        count,
        positionList
    };
}

// Записуємо відповідь у файл
writeJson(goodPositionsCount(plan), './json/output.json');